#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.commons.azurerm_role_assignment.subs_asyn_staging_write_to_sbt must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_staging_write_to_sbt" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events/providers/Microsoft.Authorization/roleAssignments/8600f58c-ca98-b0f7-d289-5613239c3a59" -> (known after apply)
      ~ name                             = "8600f58c-ca98-b0f7-d289-5613239c3a59" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/69a216fc-b8fb-44d8-bc22-1f3c2cd27a39" -> (known after apply)
      ~ scope                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_role_assignment.subs_asyn_write_to_sbt must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_write_to_sbt" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events/providers/Microsoft.Authorization/roleAssignments/1d37733d-0f1e-c570-904c-ae88b46d1341" -> (known after apply)
      ~ name                             = "1d37733d-0f1e-c570-904c-ae88b46d1341" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/69a216fc-b8fb-44d8-bc22-1f3c2cd27a39" -> (known after apply)
      ~ scope                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_servicebus_namespace.main must be replaced
-/+ resource "azurerm_servicebus_namespace" "main" {
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://ts-trial-srvb.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb" -> (known after apply)
      ~ minimum_tls_version                 = "1.2" -> (known after apply)
        name                                = "ts-trial-srvb"
        tags                                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      - zone_redundant                      = true -> null # forces replacement
        # (7 unchanged attributes hidden)

      - network_rule_set {
          - default_action                = "Allow" -> null
          - ip_rules                      = [] -> null
          - public_network_access_enabled = true -> null
          - trusted_services_allowed      = false -> null
        }
    }

  # module.commons.azurerm_servicebus_topic.events must be replaced
-/+ resource "azurerm_servicebus_topic" "events" {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT10M" -> (known after apply)
      - enable_batched_operations               = false -> null
      - enable_express                          = false -> null
      ~ enable_partitioning                     = false -> true # forces replacement
      ~ id                                      = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
      ~ max_size_in_megabytes                   = 81920 -> (known after apply)
        name                                    = "ts-trial-topic-events"
      ~ namespace_id                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb" # forces replacement -> (known after apply) # forces replacement
      - requires_duplicate_detection            = false -> null
      - support_ordering                        = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01-staging" -> null
            # (33 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01"
        name                                           = "ts-p-itn-subscription-async-fn-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (27 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01-staging"
            # (33 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
            # (26 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 5 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.commons.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/commons.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
